import React, { useState } from 'react';
import "../styles/Question.css"

const accordions = [
  { id: 1, head: "پرتوک چیست؟", para: "پرتوک ساده‌ترین راه برای شروع درآمدزایی مستقیم از طرفداران است. خوانندگان یا بینندگان محتوا‌های شما در صورت تمایل به حمایت مبلغ دلخواهی تحت عنوان خرید قهوه برای شما اهدا می‌کنند." },
  { id: 2, head: "چگونه میتوانم با پرتوک تماس بگیرم؟", para: "در صورت داشتن نظرات، انتقادات و پیشنهادات در رابطه با پرتوک می‌توانید در قسمت تماس با ما و یا قسمت تیکت در پنل کاربری و یا شبکه‌های اجتماعی ما را آگاه فرمایید." },
  { id: 3, head: "پرتوک چه تفاوتی با دیگر پلتفرم ها دارد؟", para: "شما می‌توانید در صورت هرگونه نیازمندی جدید، آن را با پرتوک در میان بگذارید. سعی ما بر این است که یک پلتفرم کامل و جامع در اختیار کاربران قرار دهیم." },
  { id: 4, head: "ایا استفاده از پرتوک هزینه ایی دارد؟", para: "4 درصد از هر تراکنش برای هزینه های سرور ، پنل پیامکی و.. کسر میشود" },
  { id: 5, head: "مخاطبان من چگونه میتوانند پرداخت کنند؟", para: "بسته به فعالیتی که دارید می‌توانید لینک پروفایل خود را به خوانندگان یا بینندگان خود معرفی کنید. کاربران با کلیک رو لینک پروفایل شما یا اسکن کردن QR Code پروفایل شما می‌توانند در صفحه پرتوک به شما دونیت کنند." },
  { id: 6, head: "چه کسانی میتوانند از پرتوک استفاده کنند؟", para: "تمامی کسانی که در زمینه هنری یا محتوایی اعم از هنرمندان، پادکست‌،‌ها نویسندگان، صنایع دستی، عکاسان، فیلم‌سازان، بازیگران و موسیقی‌دان‌های، برنامه نویسان، فن پیچ‌ها یا پیچ‌های آموزشی اینستاگرام و ... همگی می‌توانند از پرتوک استفاده کنند." },
  { id: 7, head: "حد نصاب کیف پول برای تسویه حساب چقدر است؟", para: "در حال حاظر با کیف پول 40 هزار تومان می‌توانید درخواست تسویه حساب خودتان را وارد کنید که بعد از 24 یا حداکثر 48 ساعت از طرف پرتوک به حسابتان واریز خواهد شد. دقت داشته باشید که شماره حساب و نام دارنده حساب را در قسمت اطلاعات حساب بانک وارد نمیاد." }
  , { id: 8, head: "چگونه میتوانم از پرتوک حمایت کنم؟", para: "میتوانید به پرتوک قهوه دونیت کنید و یا با معرفی کردن از پرتوک حمایت کنید با حمایت کردن از پرتوک شما نیز نقش مهمی در تولید محتوا رایگان خواهید داشت." }
]

const FAQ = () => {
  let number = 1;
  const [open, setOpen] = useState(false);

  const toggleAccordion = (accordionId) => {
    if (open === accordionId) {
      setOpen(false)
    } else {
      setOpen(accordionId)
    }
  }

  return (
    <div className='question md:mx-20 mx-10'>
      <p>سوالات متداول</p>
      {
        accordions.map(accordion => {
          return (
            <div className="questionInto" onClick={() => toggleAccordion(accordion.id)} key={accordion.id}>
              <ul>
                <li>
                  {`${number++}`} ) {accordion.head}
                </li>
              </ul>
              {
                open === accordion.id && (
                  <div className='answerBox'>
                    <span>
                      {accordion.para}
                    </span>
                  </div>
                )
              }
            </div>
          )
        })
      }
    </div>
  )
}

export default FAQ

