import React, { useState } from 'react';
import SharePartook from "../components/SharePartook/SharePartook";
import { BsThreeDotsVertical } from "react-icons/bs";
import book from "../assets/images/book.jpg";
import { BsHeart } from "react-icons/bs";
import "../styles/Articles.css"

const TermsAndConditions = () => {
    const [openBox, setOpenBox] = useState(false);
    const [like, setLike] = useState(false);
    return (
        <div>
            <SharePartook />
            <div className='content md:px-20 px-10'>
                <div className="flexAlign contentPage">
                    <div className='flexCol'>
                        <span className='headArticle flex'>قوانین کافیته</span>
                        <p className='dateArticle'>1402/01/01</p>
                    </div>
                    <div>
                        <BsThreeDotsVertical size={24} onClick={() => setOpenBox(!openBox)} className='iconDot' />
                    </div>
                    {
                        openBox && (
                            <div className='boxOpen flexAlign'>
                                <span>گزارش تخلف</span>
                            </div>
                        )
                    }
                </div>
                <h1 className='headerArticles flexAlign'> شرایط و قوانین استفاده</h1>
                <p className='headArticleDonait flex'>شرایط استفاده از حساب کاربری :
                </p>
                <ol className='listArticle'>
                    <li>سرویس "پرتوک" به منظور تشویق و فرهنگ سازی برای محتوا های رایگان ایجاد شده است. هرگونه استفاده دیگر و یا سوء استفاده از این سرویس برای امور مجرمانه یا خلاف قوانین کشوری ایران توسط کاربران ممنوع می‌باشد. در صورت مشاهده ،حساب کاربری شخص متخلف به صورت دائم مسدود و به مراجع قانونی ارجاع داده خواهد شد.</li>
                    <li>کاربران در سرویس "پرتوک" می بایست در زمان ثبت نام و استفاده از سرویس "پرتوک" در حفظ و نگهداری کلیه اطلاعات خود دقت کنند. مسئولیت حفظ و نگهداری اطلاعات ثبت شده و استفاده از سرویس "پرتوک" بر عهده کاربران میباشد. کاربران موظف هستند، اطلاعات هویتی خود را به صورت کامل و صحیح وارد کنند و در صورت بروز هرگونه مغایرت، عواقب آن متوجه کاربر خواهد بود.</li>
                    <li>ایجاد حساب کاربری با استفاده از نام و هویت حقیقی یا حقوقی شخص دیگر به عنوان جعل هویت شناسایی خواهد شد و حساب کاربری شخص خاطی مسدود خواهد شد</li>
                    <li>تنها راه ارتباطی برای موضوعات پشتیبانی و پیگیری سوالات کاربران ایمیل و سیستم پشتیبانی معرفی شده داخل سایت "پرتوک" می باشد، در صورت استفاده نامناسب از راه ارتباطی با تیم "پرتوک" و ایجاد مزاحمت برای تیم پشتیبانی (شامل ارسال پیام تکراری به تعداد زیاد، استفاده از الفاظ رکیک و فحاشی به شخص حقیقی یا حقوقی، تهدید و خشونت بر علیه تیم پشتیبانی و تیم اجرایی "پرتوک" ، توهین به دین، مقدسات، سیاست و قوانین کشور جمهوری اسلامی ایران) امکان ارسال پیام برای حساب کاربری شخص متخلف تا مدت معلوم  مسدود خواهد شد.</li>
                    <li>
                        کاربران امکان واگذاری یا فروش حساب کاربری خود به دیگران را ندارند. در صورت مشاهده، تیم "پرتوک" علاوه بر مسدود سازی حساب کاربری شخص متخلف، حق هر گونه پیگیری قضایی را نیز بر خود محفوظ می دارد. همچنین مسئولیت و عواقب آن بر عهده شخص حقیقی/حقوقی متخلف می باشد.</li>
                    <li>رعایت کلیه قوانین سرویس "پرتوک" برای کلیه کاربران ضروری می باشد و نقض و سوء استفاده از هر کدام از این قوانین به طور کلی ممنوع است و در صورت نقض هر کدام از قوانین کاربری به نحوی که عمل کاربر منجر به هر میزان زیان و خسارت مادی و معنوی و برندینگ "پرتوک" شود، تیم "پرتوک" حق هر گونه شکایت رسمی در مراجع قضایی بر علیه متخلف را برای خود محفوظ می دارد و شخص خاطی می بایست کلیه خسارت وارده را جبران نماید.</li>
                    <li>در صورت مسدود شدن حساب کاربری حقیقی یا حقوقی افراد، تنها راه آزادسازی آن ارتباط با پشتیبانی است و ساخت حساب کاربری دیگر توسط آن شخص ممنوع می باشد و "پرتوک" حق مسدود سازی مجدد آن حساب کاربری را برای خود محفوظ می‌دارد.</li>
                </ol>
                <p className='headArticleDonait flex mt-10 mb-4'>حقوقی:</p>
                <ol className='listArticle'>
                    <li>درصد پورسانت سایت از مبالغ حمایتی ۴ درصد از هر تراکنش می‌باشد که شامل ۱ درصد کارمزد درگاه و حواله بانکی و مابقی هزینه هاستینگ می باشد.
                        <li>در صورت انجام هرگونه تراکنش غیر مجاز (فیشینگ، استفاده از حساب بانکی بدون اطلاع صاحب مالک حساب و غیره) توسط حامی یا شخص دارنده سرویس "پرتوک". مسئولیت هرگونه عواقب بر عهده شخص دارنده درگاه پرداخت خواهد بود. همچنین در صورت درخواست مراجع قضایی کشور مبنی بر دریافت اطلاعات حساب کاربری شخص مورد نظر، تیم "پرتوک" همکاری لازم را انجام خواهد داد.</li>
                        <li>تمامی تراکنش‌های صورت گرفته تنها باید از طریق درگاه‌های معتبر و مشخص شده در "پرتوک" انجام شود و کاربر فقط امکان اشتراک گذاری درگاه خود را در سرویس‌های دارای مجوز جمهوری اسلامی ایران دارد. هرگونه استفاده دیگر برای جلب حمایت غیرقانونی است.</li>
                        <li>استفاده از سرویس جذب حمایت "پرتوک" تنها در قالب قوانین جمهوری اسلامی ایران امکان پذیر است و به کارگیری آن برای هرگونه اعمال مجرمانه ای مانند شرط بندی، پیش بینی، مسابقات غیر قانونی، بخت آزمایی، قمار و سایر موارد مشابه ممنوع است و موجب پیگرد قانونی از مراجع ذی‌صلاح خواهد شد.</li>
                        <li>استفاده از سرویس "پرتوک" برای جلب حمایت به منظور امور حزبی، سیاسی و یا مذهبی و امور غیر قانونی، به طور کلی ممنوع بوده و حساب کاربری خاطی مسدود خواهد شد.</li>
                        <li>تمامی حمایت‌های جذب شده توسط کاربران به صورت مستقیم و بدون هیچ گونه واسطه ای و تنها توسط درگاه ها یار ها (زرین پال، آی دی پی و …) به حساب وارد شده توسط کاربر "پرتوک" واریز خواهد شد. در صورت بروز هر گونه اختلال و مشکل در این زمینه تمامی مسئولیت مربوطه متوجه به سرویس درگاه پرداخت مورد نظر خواهد بود.</li>
                        <li>پرتوک" این حق را دارد که در هر زمان قوانین و شرایط استفاده را تغییر دهد و کاربران موظف اند که به صورت دوره ای و قبل از هر بار استفاده از سرویس، قوانین و شرایط استفاده از "پرتوک" را مجددا با دقت مطالعه نمایند.</li>
                    </li>
                </ol>
                <img src={book} alt="book" className='bookArticle flexAlign' />
                <div className='flexAlign'>
                    <BsHeart className={like ? "likeArticle" : "disslike"} size={20} onClick={() => setLike(!like)} />
                    <span>1</span>
                </div>
            </div>
        </div>
    )
}

export default TermsAndConditions