import avatar from "../assets/images/userAvatar.png"


export const dataArticles = [
    {
        id: 1, img: avatar, user: "تستی", date: "1402/07/8", category: "علمی", header: "هوش مصنوعی و اینده ی برنامه نویسان", content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
    },
    {
        id: 2,  img: avatar, user: "تستی", date: "1402/07/8", category: "سیاسی", header: "حجاب اجباری و گشت ارشاد", content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
    },
    {
        id: 3, img: avatar, user: "تستی", date: "1402/07/8", category: "علمی", header: "هوش مصنوعی و اینده ی برنامه نویسان", content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
    },
    {
        id: 4, img: avatar, user: "تستی", date: "1402/07/8", category: "ورزشی", header: "ادوار مختلف جام های جهانی", content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
    },
    {
        id: 5, img: avatar, user: "تستی", date: "1402/07/8", category: "هنری", header: "تحقیق مختصر در مورد هنر و هنرمند", content: "هنر در واقع ایده و یا تخیل و احساس درونی یک فرد است که با خلاقیت خالق آن به‌منظور رساندن یک مفهوم به وجود می‌آید. که فکر و تجربه نیز شاید در آن موثر باشد. اکثر ما وقتی سخن از هنر می‌شود به دنبال زیبایی هستیم. شنیدن یک آهنگ دلنشین، دیدن یک تابلوی نقاشی زیبا و یا خواندن یک شعر عاشقانه و امثال این. اما هنر همیشه همراه با زیبایی نیست. ممکن است یک عکس و یک فیلم دلخراش و یا یک رمان ترسناک که از نظر حسی برای ما زیبایی نداشته و ناراحت کننده است هم شامل آثار هنری شوند. گفتنی است آثار هنری که در دسترس ما هستند در زندگی ما اثربخش هستند و با گذشت زمان با فرهنگ ما انس گرفته و برای ما معنی پیدا می‌کنند. حتی گاهی تاریخ را می‌سازند. مثلا تخت جمشید یک اثر هنری بزرگ است که اکنون برای ما هم تاریخ و هم فرهنگ مردمان آن زمان را بیان می‌کند. ناگفته نماند که این آثار هنری خالقی دارند که هنرمند نام می‌گیرد. از آنجا که پسوند «مند» به معنی دارندگی است پس هنرمند شخصی است که صاحب هنر است. شخصی که با استفاده از توانایی خود در تبدیل احساس و تخیل‌اش به یک اثری که دیگر افراد قادر به خلق آن نبودند. در خلق یک اثر هنری توسط هنرمند احساس موثرتر از منطق و فکر است."
    },
    {
        id: 6, img: avatar, user: "تستی", date: "1402/07/8", category: "ادبی", header: "زبان مادری و هویت انسان", content: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد."
    }
];

export const btns = [
    { id: 1, name: "همه مقالات", value: "همه مقالات" },
    { id: 2, name: "سیاسی", value: "سیاسی" },
    { id: 3, name: "علمی", value: "علمی" },
    { id: 4, name: "ورزشی", value: "ورزشی" },
    { id: 5, name: "ادبی", value: "ادبی" },
    { id: 6, name: "هنری", value: "هنری" },
]